
### Ex_1
Телефонные номера в адресной книге мобильного телефона имеют один из следующих форматов: +7<код><номер> 8<код><номер> <номер> где <номер> — это семь цифр, а <код> — это три цифры или три цифры в круглых скобках. Если код не указан, то считается, что он равен 495. Кроме того, в записи телефонного номера может стоять знак “-” между любыми двумя цифрами (см. пример). На данный момент в адресной книге телефона Васи записано всего три телефонных номера, и он хочет записать туда еще один. Но он не может понять, не записан ли уже такой номер в телефонной книге. Помогите ему! Два телефонных номера совпадают, если у них равны коды и равны номера. Например, +7(916)0123456 и 89160123456 — это один и тот же номер. 

```
def answer(troom, tcond, cond):
    if troom <= tcond:
        if cond in ['freeze', 'fan']:
            return troom
    else:
        if cond in ['heat', 'auto']:
            return troom
    return tcond
```
    
 ### Ex_2
Даны три натуральных числа. Возможно ли построить треугольник с такими сторонами. Если это возможно, выведите строку YES, иначе выведите строку NO.

Треугольник — это три точки, не лежащие на одной прямой.


```
a = int(input())
b = int(input())
c = int(input())
if (a+b > c) and (b+c > a) and (a+c > b):
    print('YES')
else:
    print('NO')
```

### Ex_3
Телефонные номера в адресной книге мобильного телефона имеют один из следующих форматов: +7<код><номер> 8<код><номер> <номер> где <номер> — это семь цифр, а <код> — это три цифры или три цифры в круглых скобках. Если код не указан, то считается, что он равен 495. Кроме того, в записи телефонного номера может стоять знак “-” между любыми двумя цифрами (см. пример). На данный момент в адресной книге телефона Васи записано всего три телефонных номера, и он хочет записать туда еще один. Но он не может понять, не записан ли уже такой номер в телефонной книге. Помогите ему! Два телефонных номера совпадают, если у них равны коды и равны номера. Например, +7(916)0123456 и 89160123456 — это один и тот же номер.

```
import re 
def reformat_numebr(number):
    num_cor = ''.join(re.findall(r'\d+', number))
    if len(num_cor) > 7:
        return num_cor[1:]
    else:
        st = '495' + num_cor[-7:]
        return st
        
n = 4
numbers = [input() for _ in range(n)]
for el in numbers[1:]:
    if reformat_numebr(el) == reformat_numebr(numbers[0]):
        print('YES')
    else:
        print('NO')
```

### Ex_4
Решите в целых числах уравнение: sqrt(ax+b) = c
a, b, c – данные целые числа: найдите все решения или сообщите, что решений в целых числах нет.

```
coeff = [int(input()) for _ in range(3)]
 
if coeff[2] < 0:
    print('NO SOLUTION')
elif coeff[0] == 0:
    if coeff[1] == coeff[2]**2:
        print('MANY SOLUTIONS')
    else:
        print('NO SOLUTION')
else:
    x = (coeff[2]**2 - coeff[1])/coeff[0]
    print(x)
    if x % 1 == 0:
        if (coeff[0]*x + coeff[1]) < 0:
            print('NO SOLUTION')
        elif (coeff[0]*x + coeff[1]) >=0:
            print(int(x))
    elif x % 1 != 0:
        print('NO SOLUTION')
```

### Ex 7
Имеется N кг металлического сплава. Из него изготавливают заготовки массой K кг каждая. После этого из каждой заготовки вытачиваются детали массой M кг каждая (из каждой заготовки вытачивают максимально возможное количество деталей). Если от заготовок после этого что-то остается, то этот материал возвращают к началу производственного цикла и сплавляют с тем, что осталось при изготовлении заготовок. Если того сплава, который получился, достаточно для изготовления хотя бы одной заготовки, то из него снова изготавливают заготовки, из них – детали и т.д. Напишите программу, которая вычислит, какое количество деталей может быть получено по этой технологии из имеющихся исходно N кг сплава. 

```
a = str(input()).split()
m = int(a[0])
mz = int(a[1])
md = int(a[2])
x = 0
print(m, mz, md)
while (m >= mz) and (mz >= md):
    t = m // mz * (mz // md)
    m = m - t * md
    x = x + t
print(x)
```

### Ex 8


На некоторых кросс-платформенных станциях метро (как, например, «Третьяковская») на разные стороны платформы приходят поезда разных направлений. Таня договорилась встретиться с подругой на такой станции, но поскольку подруга приехала из другого часового пояса, то из-за джетлага сильно проспала, и Тане пришлось долго её ждать. Поезда всегда ходят точно по расписанию, и Таня знает, что поезд стоит на платформе ровно одну минуту, а интервал между поездами (время, в течение которого поезда у платформы нет) составляет a минут для поездов на первом пути и b минут для поездов на втором пути. То есть на первый путь приезжает поезд и стоит одну минуту, затем в течение a минут поезда у платформы нет, затем в течение одной минуты у платформы стоит следующий поезд и т. д.

Пока Таня стояла на платформе, она насчитала n поездов на первом пути и m поездов на втором пути. Определите минимальное и максимальное время, которое Таня могла провести на платформе, или сообщите, что она точно сбилась со счёта.

Все поезда, которые видела Таня, она наблюдала в течение всей минуты, то есть Таня не приходит и не уходит с платформы посередине той минуты, когда поезд стоит на платформе.


```
int1 = int(input())
int2 = int(input())
col1 = int(input())
col2 = int(input())
min1 = col1 + int1 * (col1 - 1 ) 
max1 = col1 + int1 * (col1 + 1 )
min2 = col2 + int2 * (col2 - 1 ) 
max2 = col2 + int2 * (col2 + 1 )
if min1 > min2 :              
    totalmin = min1
else :
    totalmin = min2
if max1 > max2 :            
    totalmax = max2
else :                        
    totalmax = max1
if totalmin > totalmax :      
    print(-1)
else :
    print(totalmin , totalmax)
```

### Ex 9
За многие годы заточения узник замка Иф проделал в стене прямоугольное отверстие размером D × E. Замок Иф сложен из кирпичей, размером A × B × C. Определите, сможет ли узник выбрасывать кирпичи в море через это отверстие, если стороны кирпича должны быть параллельны сторонам отверстия.

```
a = int(input())
b = int(input())
c = int(input())
d = int(input())
e = int(input())
if a <= d and b <= e or a <= e and b <= d:
    print("YES")
elif c <= d and b <= e or c <= e and b <= d:
    print("YES")
elif a <= d and c <= e or a <= e and c <= d:
    print("YES")
else:
    print("NO")
```

### Ex 10


Даны числа a, b, c, d, e, f. Решите систему линейных уравнений

ax + by = e,
cx + dy = f

```
a = float(input())
b = float(input())
c = float(input())
d = float(input())
e = float(input())
f = float(input())
if a == 0 and b == 0 and c == 0 and d == 0 and e == 0 and f == 0:
    print(5)
elif a * d == b * c and a * f != c * e:
    print(0)
elif a == 0 and b == 0 and e != 0:
    print(0)
elif c == 0 and d == 0 and f != 0:
    print(0)
elif a == 0 and c == 0 and b * f != d * e:
    print(0)
elif b == 0 and d == 0 and a * f != c * e:
    print(0)
elif a * d == b * c and a * f == c * e:
    if b == 0 and d == 0:
        if a != 0 and c != 0:
            print(3, e / a)
        elif a == 0:
            if e == 0:
                print(3, f / c)
        elif c == 0:
            if f == 0:
                print(3, e / a)
    elif a == 0 and c == 0:
        if b != 0:
            print(4, e / b)
        elif d != 0:
            print(4, f / d)
    elif b != 0:
        print(1, -a / b, e / b)
    elif d != 0:
        print(1, -c / d, f / d)
else:
    x = (e * d - b * f) / (a * d - b * c)
    y = (a * f - e * c) / (a * d - b * c)
    print(2, x, y)
```
